/**
 * Класс для работы с пользователем
 * @author Ilya
 * @version 1.0
 */
public class pract8 {
    /**
     * Метод возвращает приветствие
     * @param name имя пользователя
     * @return строка приветствия
     */
    public String greet(String name) {
        return "Привет, " + name;
    }
}
//Javadoc — это утилита Java для автоматической генерации документации на основе специальных комментариев /** */. Она позволяет описывать классы, методы и параметры, а затем формировать HTML-документацию проекта.